რიცხვები = [10, 20, 30, 40, 50, 60, 70, 80, 90]

# append() ფუნქციის გამოყენება: რიცხვის 100 დამატება სიაში
რიცხვები.append(100)
print("append() შემდეგ:", რიცხვები)

# insert() ფუნქციის გამოყენება: 5-ის დამატება სიას დაწყებაში
რიცხვები.insert(0, 5)
print("insert() შემდეგ:", რიცხვები)

# remove() ფუნქციის გამოყენება: 30 რიცხვის ამოღება სიიდან
რიცხვები.remove(30)
print("remove() შემდეგ:", რიცხვები)

# sort() ფუნქციის გამოყენება: სიას ზრდის მიხედვით დასალაგება
რიცხვები.sort()
print("sort() შემდეგ:", რიცხვები)

# reverse() ფუნქციის გამოყენება: სიას თანმიმდევრობის შესაცვლელად
რიცხვები.reverse()
print("reverse() შემდეგ:", რიცხვები)

# index() ფუნქციის გამოყენება: 50 რიცხვის ინდექსის მოსაძებნად
ინდექსი = რიცხვები.index(50)
print("50 რიცხვის ინდექსი:", ინდექსი)

# count() ფუნქციის გამოყენება: დათვალეთ რამდენჯერ გამოჩნდება სიაში 20
count = რიცხვები.count(20)
print("20 რიცხვის რაოდენობა:", count)